In [1]:
import numpy as np

import pandas as pd

from pandas import Series,DataFrame

In [2]:
import webbrowser
website='http://en.wikipedia.org/wiki/NFL_win-loss_records'
webbrowser.open(website)

True

In [12]:
nfl_frame = pd.read_clipboard()

In [13]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,914,520,388,6,0.572,1960,NFC East
1,2,Green Bay Packers,"1,368",756,574,38,0.567,1921,NFC North
2,3,New England Patriots,916,512,395,9,0.564,1960,AFC East

In [14]:
nfl_frame.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Division'],
      dtype='object')

In [16]:
nfl_frame['First NFL Season']

0    1960
1    1921
2    1960
Name: First NFL Season, dtype: int64

In [18]:
DataFrame(nfl_frame,columns = ['Team','First NFL Season','Division'])

                   Team  First NFL Season   Division
0        Dallas Cowboys              1960   NFC East
1     Green Bay Packers              1921  NFC North
2  New England Patriots              1960   AFC East

In [19]:
DataFrame(nfl_frame,columns = ['Team','First NFL Season','Division'])

                   Team  First NFL Season   Division
0        Dallas Cowboys              1960   NFC East
1     Green Bay Packers              1921  NFC North
2  New England Patriots              1960   AFC East

In [20]:
nfl_frame.tail(2)

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
1,2,Green Bay Packers,"1,368",756,574,38,0.567,1921,NFC North
2,3,New England Patriots,916,512,395,9,0.564,1960,AFC East

In [29]:
nfl_frame.loc[0]

Rank                             1
Team                Dallas Cowboys
GP                             914
Won                            520
Lost                           388
Tied                             6
Pct.                         0.572
First NFL Season              1960
Division                  NFC East
Name: 0, dtype: object

In [30]:
nfl_frame['Stadium'] = "Levi's Stadium"

In [32]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,914,520,388,6,0.572,1960,NFC East,Levi's Stadium
1,2,Green Bay Packers,"1,368",756,574,38,0.567,1921,NFC North,Levi's Stadium
2,3,New England Patriots,916,512,395,9,0.564,1960,AFC East,Levi's Stadium

In [34]:
nfl_frame['Stadium'] = np.arange(3)

In [35]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,914,520,388,6,0.572,1960,NFC East,0
1,2,Green Bay Packers,"1,368",756,574,38,0.567,1921,NFC North,1
2,3,New England Patriots,916,512,395,9,0.564,1960,AFC East,2

In [41]:
stadiums = Series(["Levi's Stadium","AT&T Sadium"], index = [2,0])

In [42]:
nfl_frame['Stadium'] = stadiums

In [43]:
nfl_frame

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division,Stadium
0,1,Dallas Cowboys,914,520,388,6,0.572,1960,NFC East,AT&T Sadium
1,2,Green Bay Packers,"1,368",756,574,38,0.567,1921,NFC North,NaN
2,3,New England Patriots,916,512,395,9,0.564,1960,AFC East,Levi's Stadium

In [44]:
data = {'City':['SF','LA','NYC'],'Population':[1,2,3]}

In [47]:
city_frame = DataFrame(data)

In [48]:
city_frame

  City  Population
0   SF           1
1   LA           2
2  NYC           3

In [1]:
import numpy as np
from pandas import Series,DataFrame

import pandas as pd

In [2]:
my_ser = Series([1,2,3,4],index=['A','B','C','D'])
my_ser

A    1
B    2
C    3
D    4
dtype: int64

In [3]:
my_index = my_ser.index

In [4]:
my_index

Index(['A', 'B', 'C', 'D'], dtype='object')

In [5]:
my_index[2]

'C'

In [6]:
my_index[0]

'A'

In [8]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

from numpy.random import randn

In [9]:
ser1 = Series([1,2,3,4], index = ['A','B','C','D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [11]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [12]:
ser2.reindex(['A','B','C','D','E','F','G'], fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [13]:
ser3 = Series(['USA','Mexico','Canada'], index=[0,5,10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [25]:
ranger = range(0,15,1)

In [27]:
list(ranger)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

In [28]:
ser3.reindex(ranger,method='ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [32]:
dframe = DataFrame(randn(25).reshape((5,5)), index = ['A','B','D','E','F'], columns = ['col1','col2','col3','col4','col5'])

In [33]:
dframe

       col1      col2      col3      col4      col5
A  0.787259 -1.793588 -0.643853  0.242618 -0.348357
B -0.000747  0.791837 -0.329123 -1.573272 -1.328087
D -0.009412  0.082983  0.705015 -0.389821  1.241143
E -0.625226 -0.601820  0.543186 -0.962311  0.307192
F  0.341991 -0.824955 -0.086439 -1.525238  0.796966

In [34]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [35]:
dframe2

       col1      col2      col3      col4      col5
A  0.787259 -1.793588 -0.643853  0.242618 -0.348357
B -0.000747  0.791837 -0.329123 -1.573272 -1.328087
C       NaN       NaN       NaN       NaN       NaN
D -0.009412  0.082983  0.705015 -0.389821  1.241143
E -0.625226 -0.601820  0.543186 -0.962311  0.307192
F  0.341991 -0.824955 -0.086439 -1.525238  0.796966

In [36]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [37]:
dframe2.reindex(columns = new_columns)

       col1      col2      col3      col4      col5  col6
A  0.787259 -1.793588 -0.643853  0.242618 -0.348357   NaN
B -0.000747  0.791837 -0.329123 -1.573272 -1.328087   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.009412  0.082983  0.705015 -0.389821  1.241143   NaN
E -0.625226 -0.601820  0.543186 -0.962311  0.307192   NaN
F  0.341991 -0.824955 -0.086439 -1.525238  0.796966   NaN

In [3]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [6]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [7]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [13]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)), index = ['SF','LA','NY'],columns=['pop','size','year'])

In [14]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [15]:
dframe1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [16]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [18]:
dframe1.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7